const MORSE_TABLE = {
    '.-':     'a',
    '-...':   'b',
    '-.-.':   'c',
    '-..':    'd',
    '.':      'e',
    '..-.':   'f',
    '--.':    'g',
    '....':   'h',
    '..':     'i',
    '.---':   'j',
    '-.-':    'k',
    '.-..':   'l',
    '--':     'm',
    '-.':     'n',
    '---':    'o',
    '.--.':   'p',
    '--.-':   'q',
    '.-.':    'r',
    '...':    's',
    '-':      't',
    '..-':    'u',
    '...-':   'v',
    '.--':    'w',
    '-..-':   'x',
    '-.--':   'y',
    '--..':   'z',
    '.----':  '1',
    '..---':  '2',
    '...--':  '3',
    '....-':  '4',
    '.....':  '5',
    '-....':  '6',
    '--...':  '7',
    '---..':  '8',
    '----.':  '9',
    '-----':  '0',
};

function decode(expr) {
    
    let array = expr.match(/.{1,10}/g);       // Разбиваю строку на массив подстрок по 10 символов каждая
    let result = [];
    
    for (let i = 0; i < array.length; i++) {  // Каждую 10-ку прогоняю с автозаменой и добавляю в результирующий массив
        let arrayItem = array[i];
        if (arrayItem === '**********') {
            result.push(' ');
        }
        result.push(MORSE_TABLE[arrayItem.replace(/10/g,'.').replace(/11/g,'-').replace(/0/g,'')]);
    }
    return result.join('');            // возвращаю строку вместо массива
}

module.exports = {
    decode
}